use movies

-- Напишете заявка, която извежда адресът на студио ‘MGM’
select * 
from studio
where name = 'MGM'

-- Напишете заявка, която извежда рождената дата на актрисата Sandra Bullock
select birthdate
from moviestar
where name = 'Sandra Bullock'

-- Напишете заявка, която извежда имената на всички актьори, които са участвали
-- във филм през 1980, в заглавието на които има думата ‘Empire’
select starname as name
from starsin
where movieyear = 1980 and movietitle like '%Empire%'

-- Напишете заявка, която извежда имената всички изпълнители на филми с нетна
-- стойност над 10 000 000 долара
select name
from movieexec
where networth > 10000000

-- Напишете заявка, която извежда имената на всички актьори, които са мъже или
-- живеят в Malibu
select *
from moviestar
where gender = 'M' or address like '%Malibu%'

use pc

-- Напишете заявка, която извежда номер на модел, честота на процесора (speed) и
-- размер на диска (hd) за всички компютри с цена по-малка от 1200 долара.
-- Задайте псевдоними за атрибутите честота и размер на диска, съответно MHz и GBselect model, speed as MHz, hd as GB from pcwhere price < 1200-- Напишете заявка, която извежда моделите и цените в евро на всички лаптопи.
-- Нека приемем, че в базата цените се съхраняват в долари, а курсът е 1.1 долара
-- за евро. Да се изведат първо най-евтините лаптопиselect model, price / 1.1from laptoporder by price -- Напишете заявка, която извежда номер на модел, размер на паметта, размер на
-- екран за лаптопите, чиято цена е по-голяма от 1000 долара
select model,  ram, screen
from laptop
where price > 1000

-- Напишете заявка, която извежда всички цветни принтери
select *
from printer
where color = 'y'

-- Напишете заявка, която извежда номер на модел, честота и размер на диска за
-- тези компютри с DVD 12x или 40x и цена по-малка от 900 долара
select code, speed, ram
from pc
where (cd = '12x' or cd = '40x') and price < 900

-- Нека рейтингът на един лаптоп се определя по следната формула: честота на
-- процесора + размер на RAM паметта + 10*размер на екрана. Да се изведат
-- кодовете, моделите и рейтингите на всички лаптопи. Резултатът да бъде
-- подреден така, че първо да бъдат лаптопите с най-висок рейтинг, а продукти с
-- еднакъв рейтинг да бъдат подредени по код.

select code, model, speed + ram + 10*screen as rating
from laptop
order by rating desc, code

use ships

-- Напишете заявка, която извежда името на класа и страната за всички класове с
-- брой на оръдията по-малък от 10select class, countryfrom classeswhere numguns < 10-- Напишете заявка, която извежда имената на всички кораби, пуснати на вода
-- преди 1915. Задайте псевдоним на колоната shipName
select name as shipName
from ships
where launched < 1915

-- Напишете заявка, която извежда имената на корабите потънали в битка и
-- имената на битките в които са потънали
select ship as shipName, battle
from outcomes
where result = 'sunk'

-- Напишете заявка, която извежда имената на корабите с име, съвпадащо с името
-- на техния класselect namefrom shipswhere name = class-- Напишете заявка, която извежда имената на всички кораби започващи с буквата Rselect *from shipswhere name like 'R%'-- Напишете заявка, която извежда имената на всички кораби, чието име е
-- съставено от точно две думи.
select *
from ships
where name like '% %' and name not like '% % %'